/**
  ******************************************************************************
  * @file    fusb305.c
  * @author  MCD Application Team
  * @version $VERSION$
  * @date    $DATE$
  * @brief   This file includes the driver for FUSB305.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE

  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#include "fusb305.h"
#include "usbpd_trace.h"
#include "usbpd_core.h"
#include "usbpd_tcpci.h"

/** @addtogroup TCPC_Driver
  * @{
  */

/** @addtogroup FUSB305_TCPC
  * @{
  */ 

/* Private typedef -----------------------------------------------------------*/
/** @defgroup FUSB305_TCPC_Private_Typedef FUSB305 Private Typedef
 * @{
 */
TCPC_DrvTypeDef  fusb305_tcpc_drv = 
{
  fusb305_tcpc_init,
  fusb305_tcpc_get_cc,
  fusb305_tcpc_get_power_status,
  fusb305_tcpc_get_fault_status,
  fusb305_tcpc_set_fault_status,
  fusb305_tcpc_get_vbus_level,
  fusb305_tcpc_set_vbus_level,
  fusb305_tcpc_set_cc,
  fusb305_tcpc_set_polarity,
  fusb305_tcpc_set_vconn,
  fusb305_tcpc_set_msg_header,
  fusb305_tcpc_set_rx_state,
  fusb305_tcpc_set_sop_supported,
  fusb305_tcpc_get_message,
  fusb305_tcpc_alert,
  fusb305_tcpc_clear_alert,
  fusb305_tcpc_transmit,
  fusb305_tcpc_set_bist_test_data,
  fusb305_tcpc_SinkTxNG,
  fusb305_tcpc_SinkTxOK,
  fusb305_tcpc_IfSinkTxOk,
};

/**
  * @}
  */

/* Private define ------------------------------------------------------------*/
/** @defgroup FUSB305_TCPC_Private_Defines FUSB305 Private Defines
 * @{
 */
#if defined(__GNUC__)
/* GNU Compiler */
#elif defined(__CC_ARM)
/* ARM Compiler */
#pragma anon_unions
#elif defined(__ICCARM__)
/* IAR Compiler */
#endif


#if !defined(USBPD_PORT_COUNT)
#define USBPD_PORT_COUNT 1
#endif

#if defined(_TRACE)
#define FUSB307_DEBUG_NONE     (0)
#define FUSB307_DEBUG_LEVEL_0  (1 << 0)
#define FUSB307_DEBUG_LEVEL_1  (1 << 1)
#define FUSB307_DEBUG_LEVEL_2  (1 << 2)
#endif /* _TRACE */

#define CC_DEBOUNCE_TIMER               4U      /**< tCCDebounce threshold = 4 ms  */

#define USBPD_TCPM_MAX_RX_BUFFER_SIZE         (30U)    /*!< Maximum size of Rx buffer */

/**
  * @}
  */
/* Private macro -------------------------------------------------------------*/
/** @defgroup FUSB305_TCPC_Private_Macros FUSB305 Private Macros
 * @{
 */
#define PD_HEADER_COUNT(__HEADER__)   (((__HEADER__) >> 12) & 7)
#define PD_HEADER_TYPE(__HEADER__)    ((__HEADER__) & 0xF)
#define PD_HEADER_ID(__HEADER__)      (((__HEADER__) >> 9) & 7)

#if defined(_TRACE)
#define FUSB307_DEBUG_TRACE(__PORT__, _LEVEL_, __STRING__) \
  if(FUSB307_DebugLevel & (_LEVEL_)) { USBPD_TRACE_Add(USBPD_TRACE_DEBUG, (__PORT__), 0, (__STRING__), sizeof(__STRING__)-1); }
#else
#define FUSB307_DEBUG_TRACE(__PORT__, _LEVEL_, __STRING__)
#endif /* _TRACE */

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/** @defgroup FUSB305_TCPC_Private_Variables FUSB305 Private Variables
 * @{
 */

#if defined(_TRACE)
uint8_t FUSB307_DebugLevel = FUSB307_DEBUG_LEVEL_0;
#endif /* _TRACE */

typedef union {
  uint8_t byte[21];
  struct {
    union {
      uint8_t VCONN_OCP; /* 0xA0 */
      struct {
        uint8_t OCP_Current:3;
        uint8_t OCP_Range:1;
        uint8_t Reserved:4;
      };
    };
    uint8_t Vendor_Reserved1;
    union {
      uint8_t RESET; /* 0xA2 */
      struct {
        uint8_t SW_RST:1;
        uint8_t PD_RST:1;
        uint8_t R_Reserved:6;
      };
    };
    uint8_t Vendor_Reserved2;
    union {
      uint8_t GPIO1_CFG; /* 0xA4 */
      struct {
        uint8_t GPO1_EN:1;
        uint8_t GPI1_EN:1;
        uint8_t GPO1_VAL:1;
        uint8_t GPIO1_Reserved:5;
      };
    };
    union {
      uint8_t GPIO2_CFG; /* 0xA5 */
      struct {
        uint8_t GPO2_EN:1;
        uint8_t GPI2_EN:1;
        uint8_t GPO2_VAL:1;
        uint8_t FR_SWAP_EN:1;
        uint8_t GPIO2_Reserved:4;
      };
    };
    union {
      uint8_t GPIO_STAT; /* 0xA6 */
      struct {
        uint8_t GPI1_VAL:1;
        uint8_t GPI2_VAL:1;
        uint8_t GPIO_Reserved:6;
      };
    };
    union {
      uint8_t DRPTOGGLE; /* 0xA7 */
      struct {
        uint8_t DRPTOGGLE_VAL:2;
        uint8_t DRP_Reserved:6;
      };
    };
    union {
      uint8_t TOGGLE_SM; /* 0xA8 */
      struct {
        uint8_t TOGGLE_SM_VAL:5;
        uint8_t TOGGLE_SM_Reserved:3;
      };
    };
    uint8_t Vendor_Reserved3[7];/* 0xA9 -> 0xAF */
    union {
      uint8_t SINK_TRANSMIT; /* 0xB0 */
      struct {
        uint8_t TXSOP:3;
        uint8_t SNK_TX_Reserved1:1;
        uint8_t RETRY_CNT:2;
        uint8_t DIS_SNK_TX:1;
        uint8_t SNK_TX_Reserved2:1;
      };
    };
    union {
      uint8_t SRC_FRSWAP; /* 0xB1 */
      struct {
        uint8_t FR_SWAP:1;
        uint8_t ManualSnkEn:1;
        uint8_t FrSwapSnkDelay:2;
        uint8_t SRC_Reserved:4;
      };
    };
    union {
      uint8_t SNK_FRSWAP; /* 0xB2 */
      struct {
        uint8_t EnFrSwapDtct:1;
        uint8_t SNK_Reserved:7;
      };
    };
    union {
      uint8_t ALERT_VD; /* 0xB3 */
      struct {
        uint8_t I_SWAP_RX:1;
        uint8_t I_SWAP_TX:1;
        uint8_t I_OTP:1;
        uint8_t I_VDD_DTCT:1;
        uint8_t I_GPI1:1;
        uint8_t I_GPI2:1;
        uint8_t I_DISCH_SUCC:1;
        uint8_t I_ALERT_Reserved:1;
      };
    };
    union {
      uint8_t ALERT_VD_MASK; /* 0xB4 */
      struct {
        uint8_t M_SWAP_RX:1;
        uint8_t M_SWAP_TX:1;
        uint8_t M_OTP:1;
        uint8_t M_VDD_DTCT:1;
        uint8_t M_GPI1:1;
        uint8_t M_GPI2:1;
        uint8_t M_DISCH_SUCC:1;
        uint8_t M_ALERT_Reserved:1;
      };
    };
  };
} regVendorInfo_t;

static struct fusb305_chip_state {
  DeviceReg_t     Registers;                /*!< Variable holding the current status of the device registers */
  regVendorInfo_t Vendor;
  USBPD_PortPowerRole_TypeDef PowerRole;    /*!< Keep the current power role */
  USBPD_PortDataRole_TypeDef DataRole ;     /*!< Keep the current data role */
  TCPC_CC_Pull_TypeDef  CC_Pull;            /*!< Keep the current CC pull */
  TCPC_RP_Value_TypeDef RP_Value;           /*!< Keep the current RP Value */
  uint8_t       VConnPresence;              /*!< Presence of VCONN */
  uint8_t       TogglingEnable;             /*!< Toggling activation */
